laswick/kinetis/phase2_embedded_c/adc.c
/*******************************************************************************
*
* adc.c
*
* jimmyMac!
*
* Low level driver for the Kinetis ADC module
*           ...because we live in an analog world
*
* See Ch 34 in K60P144M100SF2RM.pdf the TRM from Freescale
*
* Copyright (C) 2012 www.laswick.net
*
* This program is free software.  It comes without any warranty, to the extent
* permitted by applicable law.  You can redistribute it and/or modify it under
* the terms of the WTF Public License (WTFPL), Version 2, as published by
* Sam Hocevar.  See http://sam.zoy.org/wtfpl/COPYING for more details.
*
*******************************************************************************/
#include <stdlib.h>
#include <string.h>
#include <errno.h>

#include "kinetis.h"

#include "hardware.h"
#include "globalDefs.h"


#define ADC_BUFFER_SIZE 256
#define ADC_BUFFER_WRAP (ADC_BUFFER_SIZE - 1)

typedef struct {
    volatile uint32_t buffer[ADC_BUFFER_SIZE];
    volatile uint8_t  tailIdx;
    volatile uint8_t  headIdx;
    volatile uint8_t  length;
} adcBuffer_t;


volatile vref_t *vRef = VREF_REG_PTR;

typedef struct {
    int32_t            minor;
    volatile adc_t    *reg;
    volatile uint32_t *simScgcPtr;
    unsigned           simScgcEnBit;
    unsigned           simScgc5PortEn;
    int32_t            numSamples;
    int32_t          (*callBack)(int32_t adcRegister,
                                 uint32_t const *buf, int len);
    adcBuffer_t        adcBuffer[2];
#if 0
    unsigned             port;
    unsigned             sim;
    unsigned             simScgc5PortEn;
    uint32_t             txPin;
    uint32_t             rxPin;
    uint32_t             txPortCtrlBits;
    uint32_t             rxPortCtrlBits;
#endif
} adcDev_t;

typedef enum adcModule_e{
    ADC_MODULE_0,
    ADC_MODULE_1,
    NUM_ADC_MODULES,
} adcModule_t;



static adcDev_t adcList[NUM_ADC_MODULES] = {
    [ADC_MODULE_0] = {
        .minor          = ADC_MODULE_0,
        .reg            = ADC0_REG_PTR,
        .simScgcPtr     = SIM_SCGC6_PTR,
        .simScgcEnBit   = SIM_SCGC6_ADC0_ENABLE,
        .simScgc5PortEn = ADC0_PORT_ENABLE,
    },
    [ADC_MODULE_1] = {
        .minor          = ADC_MODULE_1,
        .reg            = ADC1_REG_PTR,
        .simScgcPtr     = SIM_SCGC3_PTR,
        .simScgcEnBit   = SIM_SCGC3_ADC1_ENABLE,
        .simScgc5PortEn = ADC1_PORT_ENABLE,

    },
};


static void adcNotify(adcDev_t *adc, int32_t adcRegister,
                                     adcBuffer_t *bufferPtr)
{
    uint32_t buf[bufferPtr->length];
    int i;
    for (i = 0; i < bufferPtr->length; i++) {
        buf[i] = bufferPtr->buffer[bufferPtr->headIdx];
        bufferPtr->headIdx = (bufferPtr->headIdx + 1)
            & ADC_BUFFER_WRAP;
    }
    adcList[adc->minor].callBack(adcRegister, buf, bufferPtr->length);
    bufferPtr->length = 0;
    return;
}
/******************************************************************************
* isrAdcX (void)
*
* Conversion complete ISR
*
******************************************************************************/
static void isrHandler(int minor)
{
    adcDev_t *adc = &adcList[minor];
    uint32_t data;
    adcBuffer_t *bufferPtr;
    int32_t adcRegister;


    if (adc->reg->sc1a & ADC_SC1_COCO_BIT) {
        data = adc->reg->ra;
        adcRegister = 0;
    }
    else if (adc->reg->sc1b & ADC_SC1_COCO_BIT) {
        data = adc->reg->rb;
        adcRegister = 1;
    }
    else {
        /* Cant' happed ? */
        assert(0);
        return;
    }

    bufferPtr = &adcList[minor].adcBuffer[adcRegister];
    bufferPtr->buffer[bufferPtr->tailIdx] = data;
    bufferPtr->tailIdx = (bufferPtr->tailIdx + 1) & ADC_BUFFER_WRAP;
    bufferPtr->length++;

    if (adc->callBack && (bufferPtr->length >= adc->numSamples)) {
        adcNotify(adc, adcRegister, bufferPtr);
    }
    return;
}

static void isrAdc0(void)
{
    isrHandler(ADC_MODULE_0);
    return;
}

static void isrAdc1(void)
{
    isrHandler(ADC_MODULE_1);
    return;
}

/******************************************************************************
 *  calAdc
 *
 *  Performs ADC calibration per the TRM 34.4.7
 *
 *  returns TRUE is cal successful or FALSE if you are an a$$hole.
 ******************************************************************************/
static int calAdc (adcDev_t *adc)
{
    int retVal = TRUE;
    uint32_t value;
    uint32_t sc1aValue;
    uint32_t sc1bValue;

    value = adc->reg->sc3;
    value &= ~ADC_SC3_AVGS_MASK;
    value |= ADC_SC3_AVGE_BIT | ADC_SC3_AVGS_32;
    adc->reg->sc3 = value;

    value = adc->reg->cfg2;
    value &= ~ADC_CFG_ADLSTS_MASK;
    value |= ADC_CFG2_ADLSTS_ADCK_20;
    adc->reg->cfg2 = value;

    /* Turn off hw trigger */
    value = adc->reg->sc2;
    value &= ~ADC_SC2_ADTRG_BIT;
    adc->reg->sc2 = value;

    /* Turn off interrupts */
    sc1aValue = adc->reg->sc1a;
    adc->reg->sc1a &= ~ADC_SC1_AIEN_BIT;
    sc1bValue = adc->reg->sc1b;
    adc->reg->sc1b &= ~ADC_SC1_AIEN_BIT;


    /* Start cal */
    adc->reg->sc3 |= ADC_SC3_CAL_BIT;

    while (adc->reg->sc3 & ADC_SC3_CAL_BIT);

    if (adc->reg->sc3 & ADC_SC3_CALF_BIT) {
        retVal = FALSE;
    }
    else {
        uint32_t calVal = 0;

        calVal += adc->reg->clp0;
        calVal += adc->reg->clp1;
        calVal += adc->reg->clp2;
        calVal += adc->reg->clp3;
        calVal += adc->reg->clp4;
        calVal += adc->reg->clps;
        calVal /= 2; /* Shift etc if you think you are smart */
        calVal |= BIT_15;
        adc->reg->pg = calVal;

        calVal = 0;
        calVal += adc->reg->clm0;
        calVal += adc->reg->clm1;
        calVal += adc->reg->clm2;
        calVal += adc->reg->clm3;
        calVal += adc->reg->clm4;
        calVal += adc->reg->clms;
        calVal /= 2;
        calVal |= BIT_15;
        adc->reg->mg = calVal;

    }

    /* Restore interrupts */
    adc->reg->sc1a = sc1aValue;
    adc->reg->sc1b = sc1bValue;


    return retVal;
}

 /******************************************************************************
 *  calClockCfg
 *
 *  Attempts to use the provided source and setups of appropriate dividers
 *  to get f_ADCK to be 2-12 MHz.  If the bus clock is too hight to hight this
 *  range, this function will automatically change to the bus/2 source.
 *
 * NOTE: The analog clock (f_ADCK) must be between  1-18MHz
 * unless in the 16bit mode, when it must be between 2-12MHz.
 * (See K60P144M100SF.pdf pg 42).
 *
 ******************************************************************************/

static void adcClockCfg(adcDev_t *adc, int inputClock)
{
    uint32_t value;
    int divider = ADC_CFG1_ADIV_1;
    int clockHz;

    switch (inputClock) {
    case ADC_CFG1_ADICLK_BUS:
        clockHz = clockGetFreq(CLOCK_BUS);
        if (clockHz > 12 * 8 * 1000000) {
            /* Need to use bus/2 */
            inputClock = ADC_CFG1_ADICLK_BUS_DIV_2;
            clockHz /= 2;
        }
        break;
    case ADC_CFG1_ADICLK_BUS_DIV_2:
        clockHz = clockGetFreq(CLOCK_BUS) / 2;
        break;
    case ADC_CFG1_ADICLK_ADACK:
        /* Do nothing */
        break;
    case ADC_CFG1_ADICLK_ALTCLK:
#if 0
        /* TODO:Jan add OSCERCLK to clockGetFreq */
        clockHz = clockGetFreq(ADC_ALTCLK_SOURCE);
        break;
#endif
    default:
        assert(0);
        return;
    }

    if (inputClock != ADC_CFG1_ADICLK_ADACK) {
        if (clockHz > 12000000) {
            divider = ADC_CFG1_ADIV_2;
            clockHz /= 2;
        }
        if (clockHz > 12000000) {
            divider = ADC_CFG1_ADIV_4;
            clockHz /= 2;
        }
        if (clockHz > 12000000) {
            divider = ADC_CFG1_ADIV_8;
            clockHz /= 2;
        }
        if (clockHz > 12000000) {
            assert(0);
            /* Clock source is too fast */
        }
    }

    if (clockHz < 1000000) {
        assert(0);
        /* Clock source is too slow */
    }


    value  = adc->reg->cfg1;

    /*  Unless you are running high sample rates, feel free to
     *  use the low power and keep a little ice at the poles...
     */
    value |= ADC_CFG1_ADLPC_BIT;
    value |= ADC_CFG1_ADLSMP_BIT;

    /* Clear ADIV and ADICLK */
    value &= ~(ADC_CFG1_ADIV_MASK << ADC_CFG1_ADIV_SHIFT);
    value &= ~ADC_CFG1_ADICLK_MASK;

    value |= (divider & ADC_CFG1_ADIV_MASK) << ADC_CFG1_ADIV_SHIFT;
    value |= inputClock & ADC_CFG1_ADICLK_MASK;


