laswick/kinetis/phase2_embedded_c/adc.c
    adc->reg->cfg1 = value;
    return;
}

static int adcOpen(devoptab_t *dot)
{
    adcDev_t *adc;
    void  *isrPtr;
    uint32_t value;

    if (dot->priv) return FALSE; /* Device is already open */

    adc = &adcList[dot->min];
    dot->priv = adc;

#if 0
    /*
     * Config the SIM Clock Gate
     */

    SIM_SCGC5 |= adc->simScgc5PortEn;

    /*
     * Config the Port Controller
     */

#endif
    /*
     * Config the SIM Enable
     */
    *adc->simScgcPtr |= adc->simScgcEnBit;

    /* Initialization sequence described in the TRM SS 34.5.1.1 */

    /*
     * Calibrate ADC
     * See ss 34.4.7 in the TRM
     */
    while (!calAdc(adc));

    /*
     * Select input clock source CFG
     */


                                                       /* Input the bus clock */
    adcClockCfg(adc, ADC_CFG1_ADICLK_BUS);

                                               /* 12 Bit resolution */
    value = adc->reg->cfg1;
    value &= ~(ADC_CFG1_MODE_MASK << ADC_CFG1_MODE_SHIFT);
    value |= (ADC_CFG1_MODE_12_BIT & ADC_CFG1_MODE_MASK) << ADC_CFG1_MODE_SHIFT;
    adc->reg->cfg1 = value;

    /*
     * Select trigger source SC2
     */
    adc->reg->sc2 = 0; /* default the sonmonbitch */

    /*
     * Select conversions and averaging SC3
     */
                                                 /* Run continuous conversions */
    value = ADC_SC3_ADCO_BIT;
                                                 /* Use hardware averaging */
    value |= ADC_SC3_AVGE_BIT;

                        /* You know what they say, measure 4 times, cut once. */
    value |= ADC_SC3_AVGS_4;
    adc->reg->sc3 = value;

    /*
     * SC1n:
     * Select single or differential.
     * Set interrupts.
     * Select channel. SC1:SC1n
     */
    switch (adc->minor) {
    case ADC_MODULE_0:
        isrPtr = isrAdc0;
        break;
    case ADC_MODULE_1:
        isrPtr = isrAdc1;
        break;

    default:
        assert(0);
        return FALSE;
    }

    hwInstallISRHandler(ISR_ADC0 + adc->minor, isrPtr);

    value = ADC_SC1_ADCH_DISABLED;
    adc->reg->sc1a = value;
    adc->reg->sc1b = value;

    /*
     * Update PGA
     */
    /* Defaul value */


    return TRUE;
}

/*******************************************************************************
*
* This routine starts a DAC conversion
*
* RETURNS: Number conversions read
*
*******************************************************************************/
int32_t adcRead(devoptab_t *dot, const void *data, unsigned len)
{
    int32_t i;
    uint32_t *dataPtr = (uint32_t *) data;
    adcDev_t *adc;
    volatile uint32_t *adcSc1Ptr;
    volatile uint32_t *adcRPtr;
    uint32_t value;

    if (!dot || !dot->priv) return FALSE;
    else adc = (adcDev_t *) dot->priv;


    if (adc->reg->cfg2 & ADC_CFG2_MUXSEL_BIT) {
        adcSc1Ptr = &adc->reg->sc1b;
        adcRPtr  = &adc->reg->rb;
    }
    else {
        adcSc1Ptr = &adc->reg->sc1a;
        adcRPtr  = &adc->reg->ra;
    }

    for (i = 0; i < len; i++) {
        int readyRetry = 1000;
        value = adc->reg->sc1a;
        adc->reg->sc1a = value; /* SW trigger */

        while (!(*adcSc1Ptr & ADC_SC1_COCO_BIT) && --readyRetry) {
            value = *adcSc1Ptr;
        }

        if (readyRetry) {
            *dataPtr++ = *adcRPtr;
        }
        else {
            break;
        }
    }
    return dataPtr - (uint32_t *)data;
}

/*=============================================================================*/
/* POSIX FUNCTIONS                                                             */
/*=============================================================================*/

/*******************************************************************************/
/* adc_open_r                                                                  */
/*******************************************************************************/
/* Jobs of the 'open' syscall:
 *      Check device name
 *      Create a device 'state' structure, hook it to the devoptab private ptr
 *      Enable the SIM SCGC for the device
 *      Initialize the device with a default configuration
 ********************************************************************************/
int adc_open_r (void *reent, devoptab_t *dot, int mode, int flags )
{
    if (!dot || !dot->name) {
        /* errno ? */
        return FALSE;
    }

    /* Test the module instance */
    if ( dot->min >= NUM_ADC_MODULES ) {
        /* Device does not exist */
        ((struct _reent *)reent)->_errno = ENODEV;
        return FALSE;
    }

    /* Try to open */
    if (adcOpen(dot)) {
        return TRUE;
    } else {
        /* Could not allocate memory */
        return FALSE;
    }


#if 0
    /* Determine the module instance */
    if (strcmp(DEVOPTAB_ADC0_STR, dot->name) == 0 ) {
        mod = ADC_MODULE_0;
    }
    else if (strcmp(DEVOPTAB_ADC1_STR, dot->name) == 0) {
        mod = ADC_MODULE_1;
    }
    else {
        /* Device does not exist */
        ((struct _reent *)reent)->_errno = ENODEV;
        return FALSE;
    }

    /* Try to open if not already open */
    if (adcOpen(mod,dot)) {
        return TRUE;
    } else {
        /* Device is already open, is this an issue or not? */
        ((struct _reent *)reent)->_errno = EPERM;
        return FALSE;
    }
#endif
}

/*******************************************************************************/
/* adc_ioctl_r                                                                 */
/*******************************************************************************/
/* Jobs of the 'ioctl' syscall:
 *      Implement any device specific commands.
 *          Commands are listed in hardware.h in the specific driver section
  *******************************************************************************/
int adc_ioctl(devoptab_t *dot, int cmd,  int flags)
{
    adcDev_t *adc;
    volatile uint32_t *adcSc1xPtr;
    uint32_t value;
    uint32_t value2;
    int retVal = !ERROR;


    if (!dot || !dot->priv) return FALSE;
    else adc = (adcDev_t *) dot->priv;


    switch (cmd) {
    case IO_IOCTL_ADC_CALL_BACK_SET:
        if (flags) {
            adcList[adc->minor].callBack = (void *) flags;
            /* Callback implies interupt driven */
            adc->reg->sc1a |= ADC_SC1_AIEN_BIT;
            adc->reg->sc1b |= ADC_SC1_AIEN_BIT;
        }
        break;
    case IO_IOCTL_ADC_CONVERSION_CONTINUOUS:
        if (flags) {
            adc->reg->sc3 |=  ADC_SC3_ADCO_BIT;
        }
        else {
            adc->reg->sc3 &= ~ADC_SC3_ADCO_BIT;
        }
        break;
    case IO_IOCTL_ADC_TRIGGER_SELECT:
        if (flags == IO_IOCTL_ADC_TRIGGER_SELECT_HW) {
            adc->reg->sc2 |=  ADC_SC2_ADTRG_BIT;
        }
        else {
            adc->reg->sc2 &= ~ADC_SC2_ADTRG_BIT;
        }
        break;
    case IO_IOCTL_ADC_CONVERSION_TIME_SELECT:
        if (flags == IO_IOCTL_ADC_CONVERSION_TIME_FLAGS_SHORT_SAMPLE) {
            adc->reg->cfg1 &= ~ADC_CFG1_ADLSMP_BIT;
        }
        else {
            adc->reg->cfg1 |= ADC_CFG1_ADLSMP_BIT;
            adc->reg->cfg2 |= flags & ADC_CFG_ADLSTS_MASK;
        }
        break;
    case IO_IOCTL_ADC_CALIBRATE:
        retVal = calAdc(adc);
        break;
    case IO_IOCTL_ADC_AVERAGE_SELECT:
        value = adc->reg->sc3;
        switch (flags) {

        case ADC_SC3_AVGS_4:
            value |= (ADC_SC3_AVGE_BIT & ADC_SC3_AVGS_4);
            break;
        case ADC_SC3_AVGS_8:
            value |= (ADC_SC3_AVGE_BIT & ADC_SC3_AVGS_8);
            break;
        case ADC_SC3_AVGS_16:
            value |= (ADC_SC3_AVGE_BIT & ADC_SC3_AVGS_16);
            break;
        case ADC_SC3_AVGS_32:
            value |= (ADC_SC3_AVGE_BIT & ADC_SC3_AVGS_32);
            break;
        default:
            /* Send any other value to turn off averaging */
            value &= ~ADC_SC3_AVGE_BIT;
            break;
        }
        adc->reg->sc3 = value;
        break;
    case IO_IOCTL_ADC_RESOLUTION_SELECT:
        value = adc->reg->cfg1;
        value &= ~(ADC_CFG1_MODE_MASK << ADC_CFG1_MODE_SHIFT);
        value |= (flags & ADC_CFG1_MODE_MASK) << ADC_CFG1_MODE_SHIFT;
        adc->reg->cfg1 = value;
        break;
    case IO_IOCTL_ADC_DIFFERENTIAL_SET:

