laswick/kinetis/phase2_embedded_c/adc.c
        if (flags & IO_IOCTL_ADC_CHANNEL_FLAGS_REGISTER_B) {
            adcSc1xPtr = &adc->reg->sc1b;
        } else {
            adcSc1xPtr = &adc->reg->sc1a;
        }
        if (flags & IO_IOCTL_ADC_DIFF_FLAGS_MASK) {
            *adcSc1xPtr |= ADC_SC1_DIFF_BIT;
        }
        else {
            *adcSc1xPtr &= ~ADC_SC1_DIFF_BIT;
        }
        break;
    case IO_IOCTL_ADC_CHANNEL_SELECT:
        if (flags & IO_IOCTL_ADC_CHANNEL_FLAGS_REGISTER_B) {
            value = adc->reg->sc1b;
        }
        else {
            value = adc->reg->sc1a;
        }
        value &= ~IO_IOCTL_ADC_CHANNEL_FLAGS_CH_MASK;
        value |= (flags & IO_IOCTL_ADC_CHANNEL_FLAGS_CH_MASK);
        if (flags & IO_IOCTL_ADC_CHANNEL_FLAGS_REGISTER_B) {
            value2  = adc->reg->cfg2;
            value2 |= ADC_CFG2_MUXSEL_BIT;
            adc->reg->cfg2 = value2;
            /* Channel select has to be done last to start triggering as
             * setting MUXSEL invalidates the previous channel select */
            adc->reg->sc1b = value;
        }
        else {
            value2  = adc->reg->cfg2;
            value2 &= ~ADC_CFG2_MUXSEL_BIT;
            adc->reg->cfg2 = value2;
            /* Channel select has to be done last to start triggering as
             * setting MUXSEL invalidates the previous channel select */
            adc->reg->sc1a = value;
        }
        break;

    case IO_IOCTL_ADC_FLUSH_FIFO:
        {
            int32_t valueA, valueB;
            adcBuffer_t *bufferPtrA = &adcList[adc->minor].adcBuffer[0];
            adcBuffer_t *bufferPtrB = &adcList[adc->minor].adcBuffer[1];

            valueA = adc->reg->sc1a;
            valueB = adc->reg->sc1b;
            adc->reg->sc1a &= ~ADC_SC1_AIEN_BIT;
            adc->reg->sc1b &= ~ADC_SC1_AIEN_BIT;
            bufferPtrA->tailIdx = 0;
            bufferPtrA->length  = 0;
            bufferPtrB->tailIdx = 0;
            bufferPtrB->length  = 0;
            adc->reg->sc1a = valueA;
            adc->reg->sc1b = valueB;
        }
        break;
    case IO_IOCTL_ADC_SAMPLE_SIZE_SET:
        adcList[adc->minor].numSamples = flags;
        break;
    case IO_IOCTL_ADC_CLOCK_SELECT:
        adcClockCfg(adc, flags);
        break;
    case IO_IOCTL_ADC_PGASET:
        value = adc->reg->pga;
        switch (flags){
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_1:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_1 << ADC_PGA_PGAG_SHIFT);
            break;
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_2:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_2 << ADC_PGA_PGAG_SHIFT);
            break;
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_4:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_4 << ADC_PGA_PGAG_SHIFT);
            break;
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_8:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_8 << ADC_PGA_PGAG_SHIFT);
            break;
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_16:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_16 << ADC_PGA_PGAG_SHIFT);
            break;
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_32:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_32 << ADC_PGA_PGAG_SHIFT);
            break;
        case IO_IOCTL_ADC_PGA_FLAGS_GAIN_64:
            value |= ADC_PGA_PGAEN_BIT;
            value |= (ADC_PGA_PGAG_64 << ADC_PGA_PGAG_SHIFT);
            break;
        default:
            assert(0);
            retVal = ERROR;
            break;
        }
        if (retVal != ERROR) {
            /* NOTE: Should be used with IO_IOCTL_ADC_VREF_SELECT,
             * IO_IOCTL_ADC_VREF_FLAGS_ALT
             */
            /* Update pga */
            adc->reg->pga = value;
#if 0
            /* Turn on 1.2V vref */
            vRef->sc = VREF_SC_PGA_SUPPORT;
            /* Use V_ALT as reference */
            adc->reg->sc2 |= ADC_SC2_REFSEL_ALT_BIT;
#endif
        }
        break;
    case IO_IOCTL_ADC_VREF_SELECT:
        switch (flags) {
        case IO_IOCTL_ADC_VREF_FLAGS_DEFAULT:
            /* Use V_ALT as reference */
            adc->reg->sc2 &= ~ADC_SC2_REFSEL_ALT_BIT;
            break;
        case IO_IOCTL_ADC_VREF_FLAGS_ALT:
            /* Turn on 1.2V vref */
            vRef->sc = VREF_SC_PGA_SUPPORT;
            /* Use V_ALT as reference */
            adc->reg->sc2 |= ADC_SC2_REFSEL_ALT_BIT;
            break;
        default:
            assert(0);
            retVal = ERROR;
            break;
        }
        break;

    case IO_IOCTL_ADC_COMPARE_ENABLE:
        if (flags) {
            adc->reg->sc2 |= ADC_SC2_ACFE_BIT;
        }
        else {
            adc->reg->sc2 &= ~ADC_SC2_ACFE_BIT;
        }
        break;
    case IO_IOCTL_ADC_COMPARE_HIGH_LOW_SET:
        switch (flags) {
        case IO_IOCTL_ADC_COMPARE_HIGH_LOW_FLAG_GREATER:
            adc->reg->sc2 |= ADC_SC2_ACFGT_BIT;
            break;
        case IO_IOCTL_ADC_COMPARE_HIGH_LOW_FLAG_LESS:
            adc->reg->sc2 &= ~ADC_SC2_ACFGT_BIT;
            break;
        default:
            assert(0);
            retVal = ERROR;
            break;
        }
        break;
    case IO_IOCTL_ADC_COMPARE_RANGE_SET:
         if (flags) {
            adc->reg->sc2 |= ADC_SC2_ADREN_BIT;
        }
        else {
            adc->reg->sc2 &= ~ADC_SC2_ADREN_BIT;
        }
        break;
    case IO_IOCTL_ADC_COMPARE_VALUES_SET:
        adc->reg->cv1 = flags & IO_IOCTL_ADC_COMPARE_VAL_MASK;
        adc->reg->cv2 = (flags >> IO_IOCTL_ADC_COMPARE_VAL2_SHIFT)
                        & IO_IOCTL_ADC_COMPARE_VAL_MASK;
        break;
    default:
#if 0
            /*TODO Add cmds */
        IO_IOCTL_ADC_OFFSET_SET,

        IO_IOCTL_ADC_COMPARE_ENABLE,
        IO_IOCTL_ADC_COMPARE_HIGH_LOW_SET,
        IO_IOCTL_ADC_COMPARE_RANGE_SET,
        IO_IOCTL_ADC_COMPARE_VALUE_SET,
#endif

        assert(0);
        retVal = ERROR;
        break;
    }

    return retVal;
}

/*******************************************************************************/
/* adc_close_r                                                                 */
/*******************************************************************************/
/* Jobs of the 'close' syscall:
 *      Disable the SIM SCGC for the device
 *      Free the device 'state' structure, unhook it to the devoptab private ptr
 *******************************************************************************/
int adc_close_r (void *reent, devoptab_t *dot )
{
    adcDev_t *adc = dot->priv;

    if (adc) {
        /* Disable the SIMSCGC for the adc module being used*/
        *adc->simScgcPtr &= ~adc->simScgcEnBit;
        /* Unhook the private adc structure */
        dot->priv = NULL;
        return TRUE;
    }
    else {
        return FALSE;
    }
}

/*******************************************************************************/
/* adc_read_r                                                                  */
/*******************************************************************************/
/* Jobs of the 'read' syscall:
 *      Read data from the device
 *      Return the number of bytes read
 *******************************************************************************/
long adc_read_r (void *reent, devoptab_t *dot, void *buf, int len )
{
    /* You could just put your read function here, but I want switch between
     * polled & interupt functions here at a later point.*/
    return adcRead(dot, buf, len);
}

int adc_install(void)
{
    int ret = TRUE;

    if( !deviceInstall(DEV_MAJ_ADC, adc_open_r, adc_ioctl, adc_close_r,
                                                           NULL, adc_read_r) ){
        ret = FALSE;
    }
    if( !deviceRegister("adc0", DEV_MAJ_ADC, ADC_MODULE_0,  NULL) ) {
        ret =  FALSE;
    }
    if( !deviceRegister("adc1", DEV_MAJ_ADC, ADC_MODULE_1,  NULL) ) {
        ret =  FALSE;
    }

    return ret;
}


